Revit 2027 API
ParameterTypeId.FamilyRenderingType Property
 "Render Appearance Source"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FamilyRenderingType { get; }
Public Shared ReadOnly Property FamilyRenderingType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FamilyRenderingType {
	ForgeTypeId^ get ();
}
static member FamilyRenderingType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace